; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v6)
             (pred_4 ?v2 ?v3)
             (pred_7 ?v7 ?v3)
             (pred_8 ?v1 ?v7 )
	     (pred_11 ?v7)
             (pred_3 ?v8)
             (pred_12 ?v2)
             (pred_1 ?v3)
             (pred_5 ?v7)
             (pred_9 ?v2)
             (pred_10 ?v7)
             (pred_2 ))



(:action op_4
:parameters (?v9 ?v4 ?v13 ?v11)
:precondition (and (pred_3 ?v9) (pred_3 ?v4) (pred_12 ?v13) (pred_1 ?v11)
          (pred_6 ?v9 ?v4) (pred_4 ?v13 ?v11)
                   (pred_7 ?v4 ?v11) (pred_11 ?v9) 
                   (pred_5 ?v4) (pred_9 ?v13))
:effect (and  (pred_10 ?v4) (not (pred_5 ?v4))))


(:action op_3
:parameters (?v9 ?v12)
:precondition (and (pred_3 ?v9) (pred_3 ?v12)
               (pred_11 ?v9) (pred_6 ?v9 ?v12) (pred_10 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v9))))

(:action op_2
:parameters (?v9 ?v13)
:precondition (and (pred_3 ?v9) (pred_12 ?v13) 
                  (pred_11 ?v9) (pred_8 ?v13 ?v9) (pred_2 ))
:effect (and (pred_9 ?v13)
   (not (pred_8 ?v13 ?v9)) (not (pred_2 ))))


(:action op_1
:parameters (?v9 ?v5 ?v10)
:precondition (and (pred_3 ?v9) (pred_12 ?v5) (pred_12 ?v10)
                  (pred_11 ?v9) (pred_9 ?v10) (pred_8 ?v5 ?v9))
:effect (and (pred_9 ?v5) (pred_8 ?v10 ?v9)
        (not (pred_9 ?v10)) (not (pred_8 ?v5 ?v9))))

(:action op_5
:parameters (?v9 ?v13)
:precondition (and (pred_3 ?v9) (pred_12 ?v13) 
                  (pred_11 ?v9) (pred_9 ?v13))
:effect (and (pred_2 ) (pred_8 ?v13 ?v9) (not (pred_9 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_03 obj_16 obj_26 obj_30 obj_20 obj_02 obj_22 obj_28 obj_17 obj_11 obj_05 obj_06 obj_08 obj_15 obj_10 obj_18 obj_19 obj_21 obj_14 obj_27 obj_29 obj_23 obj_12 obj_01
    obj_25 obj_07
    obj_04 obj_09 obj_13
    )

    (:init
       (pred_2)

       (pred_3 obj_24)
       (pred_3 obj_03)
       (pred_3 obj_16)
       (pred_3 obj_26)
       (pred_3 obj_30)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_22)
       (pred_3 obj_28)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_08)
       (pred_3 obj_15)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_21)
       (pred_3 obj_14)
       (pred_3 obj_27)
       (pred_3 obj_29)
       (pred_3 obj_23)
       (pred_3 obj_12)
       (pred_3 obj_01)
       (pred_1 obj_25)
       (pred_1 obj_07)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_13)

       (pred_6 obj_24 obj_20)
       (pred_6 obj_24 obj_03)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_03 obj_16)
       (pred_6 obj_03 obj_24)
       (pred_6 obj_16 obj_22)
       (pred_6 obj_16 obj_26)
       (pred_6 obj_16 obj_03)
       (pred_6 obj_26 obj_28)
       (pred_6 obj_26 obj_30)
       (pred_6 obj_26 obj_16)
       (pred_6 obj_30 obj_17)
       (pred_6 obj_30 obj_26)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_02)
       (pred_6 obj_20 obj_24)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_02 obj_22)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_02 obj_20)
       (pred_6 obj_22 obj_06)
       (pred_6 obj_22 obj_28)
       (pred_6 obj_22 obj_16)
       (pred_6 obj_22 obj_02)
       (pred_6 obj_28 obj_08)
       (pred_6 obj_28 obj_17)
       (pred_6 obj_28 obj_26)
       (pred_6 obj_28 obj_22)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_17 obj_28)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_06 obj_19)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_22)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_08 obj_21)
       (pred_6 obj_08 obj_15)
       (pred_6 obj_08 obj_28)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_08)
       (pred_6 obj_10 obj_27)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_18 obj_29)
       (pred_6 obj_18 obj_19)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_19 obj_23)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_18)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_21 obj_14)
       (pred_6 obj_21 obj_08)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_14 obj_21)
       (pred_6 obj_27 obj_29)
       (pred_6 obj_27 obj_10)
       (pred_6 obj_29 obj_23)
       (pred_6 obj_29 obj_18)
       (pred_6 obj_29 obj_27)
       (pred_6 obj_23 obj_12)
       (pred_6 obj_23 obj_19)
       (pred_6 obj_23 obj_29)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_12 obj_23)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_12)
       (pred_5 obj_16)
       (pred_5 obj_27)
       (pred_5 obj_21)
       (pred_7  obj_16 obj_25)
       (pred_7  obj_27 obj_07)
       (pred_7  obj_21 obj_07)
       (pred_10 obj_24)
       (pred_10 obj_03)
       (pred_10 obj_26)
       (pred_10 obj_30)
       (pred_10 obj_20)
       (pred_10 obj_02)
       (pred_10 obj_22)
       (pred_10 obj_28)
       (pred_10 obj_17)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_06)
       (pred_10 obj_08)
       (pred_10 obj_15)
       (pred_10 obj_10)
       (pred_10 obj_18)
       (pred_10 obj_19)
       (pred_10 obj_14)
       (pred_10 obj_29)
       (pred_10 obj_23)
       (pred_10 obj_12)
       (pred_10 obj_01)

       (pred_4  obj_04 obj_25)
       (pred_4  obj_09 obj_07)
       (pred_4  obj_13 obj_25)
       (pred_8 obj_04 obj_27)
       (pred_8 obj_09 obj_22)
       (pred_8 obj_13 obj_26)
       (pred_11 obj_28)
    )

    (:goal (and
       (pred_8 obj_09 obj_11)
    ))
(:constraints
  (always (not (pred_11 obj_02)))
)
)

; plan
1. (op_3 obj_28 obj_22)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_22)
   goals met: 0 of 1
2. (op_2 obj_22 obj_09)
   deleted: (pred_8 obj_09 obj_22) (pred_2)
   added: (pred_9 obj_09)
   goals met: 0 of 1
3. (op_3 obj_22 obj_06)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_06)
   goals met: 0 of 1
4. (op_3 obj_06 obj_05)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_05)
   goals met: 0 of 1
5. (op_3 obj_05 obj_11)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_11)
   goals met: 0 of 1
6. (op_5 obj_11 obj_09)
   deleted: (pred_9 obj_09)
   added: (pred_2) (pred_8 obj_09 obj_11)
   goals met: 1 of 1
